package thread;

public class Main2 {
    public static void main(String[] args) {
        // Многопоточность позволяет нам выполнять какой-то код паралельно с другим кодом
        // Многопоточность может работать если у вас одноядерный или многоядерный компьютер
        // Многопоточность в java представлена в виде виртуальной паралельности

        // Основная цель многопоточного программирования в том чтобы реализовать
        // какой-то функционал, тоесть например клиент не ждал чего-то, чтобы 
        // какие-то сложные задачи обрабатывались где-то там на фоновом режим.

        // 2 способа создания потоков:
        // 1. создаем класс и в этом классе наследуемся от класса Thread
    }
}

class MyThread extends Thread {     //MyThread теперь поток
    
}

